app/controllers/admin/applications_controller.rb

  def edit
    @page_title = 'Student Application Details'
    @application = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @application = Application.find(params[:id])
    if @application.update(applicatin_params)
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "applications" SET "is_finance_approve" = $1, "finance_comment" = $2, "updated_at" = $3 WHERE "applications"."id" = $4  [["is_finance_approve", 0], ["finance_comment", "You some unpaid mount"], ["updated_at", "2018-10-03 00:38:51.225359"], ["id", 1]]

  def index
    if params[:search]
    else
      @applications = Application.all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT  "applications".* FROM "applications" WHERE (is_hod_approve = 2 AND department = 'IT') ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "applications" WHERE (is_dean_approve = 2 && school = "#{current_user.school}")

  def show
    @applications = Application.where(params[:id]).order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT  "applications".* FROM "applications" WHERE (is_hod_approve = '2' AND department = '') ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "applications" WHERE (is_hod_approve = 2 AND department = 'IT')

  def dashboard
    if current_user
      if current_user.role == 'Dean'
        @apnew = Application.where('is_dean_approve = 2').count
        @apapprov = Application.where('is_dean_approve = 1').count
        @apreject = Application.where('is_dean_approve = 0').count
      elsif current_user.role == 'HOD'
        @apnew = Application.where('is_hod_approve = 2').count
        @apapprov = Application.where('is_hod_approve = 1').count
        @apreject = Application.where('is_hod_approve = 0').count
      elsif current_user.role == 'Warden'
        @apnew = Application.where('is_warden_approve = 2').count
        @apapprov = Application.where('is_warden_approve = 1').count
        @apreject = Application.where('is_warden_approve = 0').count
      elsif current_user.role == 'Finance'
        @apnew = Application.where('is_finance_approve = 2').count
        @apapprov = Application.where('is_finance_approve = 1').count
        @apreject = Application.where('is_finance_approve = 0').count
      elsif current_user.role == 'Librarian'
        @apnew = Application.where('is_librarian_approve = 2').count
        @apapprov = Application.where('is_librarian_approve = 1').count
        @apreject = Application.where('is_librarian_approve = 0').count
---
SELECT COUNT(*) FROM "applications" WHERE (is_dean_approve = 2 && school = "#{current_user.school}")
SELECT COUNT(*) FROM "applications" WHERE (is_dean_approve = 1 AND school= 'ICT')
SELECT COUNT(*) FROM "applications" WHERE (is_dean_approve = 0 AND school= 'ICT')
SELECT COUNT(*) FROM `applications` WHERE (is_warden_approve = 2)
SELECT COUNT(*) FROM `applications` WHERE (is_warden_approve = 0)
SELECT COUNT(*) FROM `applications` WHERE (is_finance_approve = 2)
SELECT COUNT(*) FROM "applications" WHERE (is_dean_approve = 2 AND school= 'ICT')
SELECT COUNT(*) FROM "applications" WHERE (is_hod_approve = 2 AND department = 'IT')
SELECT COUNT(*) FROM "applications" WHERE (is_hod_approve = 1 AND department = 'IT')
SELECT COUNT(*) FROM "applications" WHERE (is_hod_approve = 0 AND department = 'IT')

    def show_applicants
      if current_user
        if current_user.role == 'Dean'
          @new = Application.where("is_dean_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @reject = Application.where("is_dean_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @approve = Application.where("is_dean_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
        elsif current_user.role == 'HOD'
          @new = Application.where("is_hod_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @reject = Application.where("is_hod_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @approve = Application.where("is_hod_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
        elsif current_user.role == 'Warden'
          @new = Application.where("is_warden_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @reject = Application.where("is_warden_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @approve = Application.where("is_warden_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
        elsif current_user.role == 'Finance'
          @new = Application.where("is_finance_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @reject = Application.where("is_finance_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @approve = Application.where("is_finance_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
        elsif current_user.role == 'Librarian'
          @new = Application.where("is_librarian_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @reject = Application.where("is_librarian_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
          @approve = Application.where("is_librarian_approve = #{params[:id]}").order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
        elsif current_user.role == 'Registrar'
          @application = Application.find(params[:id])
---
SELECT COUNT(*) FROM "applications" WHERE (is_finance_approve = 0)
SELECT  `applications`.* FROM `applications` WHERE `applications`.`id` = 4 LIMIT 1