app/controllers/admin/application_controller.rb

      def current_user
        @current_user ||=User.find(session[:user_id]) if session[:user_id]
        #@current_user ||=User.find_by_auth_token!(cookies[:auth_token]) if cookies[:auth_token]
        @current_user ||= User.find_by_auth_token!( cookies[:auth_token]) if cookies[:auth_token]
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "xNc9FTEBWVQiM8fs18_Jag"], ["LIMIT", 1]]