app/controllers/admin/password_resets_controller.rb

  def edit
    @page_title = 'Reset Password'
    @user = User.find_by_password_reset_token!(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'q7j12qpDT4Qu7ziGJ2Tzxg' LIMIT 1

  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_admin_password_reset_path, :alert => 'Password reset link have been expired!'
    elsif @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'q7j12qpDT4Qu7ziGJ2Tzxg' LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$BCPYxLVrytxE1EIwbFd3dO', `password_hash` = '$2a$10$BCPYxLVrytxE1EIwbFd3dOk2nNIfIFQhcMce0jkRVjIEErTSi.vKy', `updated_at` = '2018-09-28 18:58:33' WHERE `users`.`id` = 1