app/controllers/admin/users_controller.rb

INSERT INTO `users` (`name`, `email`, `role`, `password_hash`, `password_salt`, `created_at`, `updated_at`, `auth_token`) VALUES ('Registrar Test', 'registrar@gmail.com', 'Registrar', '$2a$10$qLoSpCkR.ixwMMf7jx.kS.c8FtJ5cr5hXfV91XPduFb8gXyvGJOTS', '$2a$10$qLoSpCkR.ixwMMf7jx.kS.', '2018-09-28 20:13:28', '2018-09-28 20:13:28', 'KduSmRk21kwYlwJM9yDmHQ')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_salt" = $1, "password_hash" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_salt", "$2a$10$62bM1hgJ1pKFYZYyxJqrye"], ["password_hash", "$2a$10$62bM1hgJ1pKFYZYyxJqryejsjYifhzY8/WOE1lYgAaaSM8xjqHGra"], ["updated_at", "2018-10-02 23:53:07.207539"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)