app/controllers/application_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`auth_token` = 'Yq4Ft23FChiWxdlBEn0iSQ\"' LIMIT 1
---
      def current_user
        #@current_user ||=Student.find(session[:user_id]) if session[:user_id]
        #@current_user ||=User.find_by_auth_token!(cookies[:auth_token]) if cookies[:auth_token]
        @current_user ||= Student.find_by_auth_token!( cookies[:auth_token]) if cookies[:auth_token]