app/controllers/applications_controller.rb

INSERT INTO `applications` (`reg_number`, `first_name`, `last_name`, `email`, `telephone`, `sex`, `department`, `level`, `academic_year`, `sponsor`, `created_at`, `updated_at`, `student_id`, `profile_picture_file_name`, `profile_picture_content_type`, `profile_picture_file_size`, `profile_picture_updated_at`) VALUES (216295023, 'Doe', 'Jeanne', 'john@doe.com', '0736529635', 'Female', 'CoE', 2, '2016-2017', 'FARG', '2018-09-29 04:32:36', '2018-09-29 04:32:36', 6, 'web_developpers.PNG', 'image/png', 750211, '2018-09-29 04:32:35')
---
  def create
    @application = Application.new(application_params)
    if @application.save

SELECT `applications`.* FROM `applications` WHERE (student_id = 3)
---
  def index
    if current_student
      @applications = Application.where("student_id = #{current_student.id}")