app/controllers/password_resets_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'nivierlos@gmail.com' LIMIT 1
---
  def create
    user = Student.find_by_email(params[:email])

SELECT  `students`.* FROM `students` WHERE `students`.`password_reset_token` = 'mFkzdZF5iRRG8UBykf7EPQ' LIMIT 1
---
  def edit
    @page_title = 'Reset Password'
    @student = Student.find_by_password_reset_token!(params[:id])

SELECT  `students`.* FROM `students` WHERE `students`.`password_reset_token` = 'mFkzdZF5iRRG8UBykf7EPQ' LIMIT 1
UPDATE `students` SET `password_salt` = '$2a$10$vRffIBCpMUIkePMHedhftO', `password_hash` = '$2a$10$vRffIBCpMUIkePMHedhftOFSTTOPwF5m6y71jOAavMxS0uJLrKlUO', `updated_at` = '2018-10-01 20:02:15' WHERE `students`.`id` = 1
---
  def update
    @student = Student.find_by_password_reset_token!(params[:id])
    if @student.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, :alert => 'Password reset link have been expired!'
    elsif @student.update(student_params)