app/controllers/students_controller.rb

  def create
    @student = Student.new(registration_params)
    if @student.save
---
INSERT INTO `students` (`reg_number`, `first_name`, `last_name`, `email`, `created_at`, `updated_at`, `password_hash`, `password_salt`, `auth_token`) VALUES (216092065, 'Hello ', 'Student', 'student@gmail.com', '2018-09-28 21:47:49', '2018-09-28 21:47:49', '$2a$10$x.izr1phV/HbU6VSjQPZ5OQ.IddFRij1kNCPfAGlhAfMEyD4UArjO', '$2a$10$x.izr1phV/HbU6VSjQPZ5O', 'sGUFY5uH_vNXEnjAi8IL7A')

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE `students` SET `last_name` = 'Jeanne', `level` = 2, `academic_year` = '2016-2017', `profile_picture_file_name` = 'web_developpers.PNG', `profile_picture_content_type` = 'image/png', `profile_picture_file_size` = 750211, `profile_picture_updated_at` = '2018-09-29 04:32:17', `sponsor` = 'FARG', `sex` = 'Female', `department` = 'CoE', `telephone` = '0736529635', `updated_at` = '2018-09-29 04:32:18' WHERE `students`.`id` = 6

  def show
    @applications = Application.where("student_id = #{current_student.id}")
    @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 5 LIMIT 1